#+PROPERTY: header-args    :results silent

* Org
** Agenda Files
   #+BEGIN_SRC emacs-lisp
     (setq org-agenda-files
           '("~/Sync/Notes/Inbox.org"
             ;"~/Sync/Notes/CASE.org"
             ;"~/Sync/Notes/CHLOE.org"
             ;"~/Sync/Notes/CURRENT.org"
             ;"~/Sync/Notes/PROJECTS.org"
             ;"~/Sync/Notes/ROSALIND.org"
             "~/Sync/Notes/SLUMOS.org"
             "~/Sync/Notes/TODO.org"))
   #+END_SRC
** Capture templates
   #+BEGIN_SRC emacs-lisp
     (unless (boundp 'org-capture-templates)
       (setq org-capture-templates '()))
     (add-to-list 'org-capture-templates '("m" "Meeting" entry (id "30E45826-5558-4029-91D7-067B057B5740")))
     (add-to-list 'org-capture-templates '("l" "Log" entry (id "45F1430A-CE5D-4A2E-A5D8-D72C93313666")
                                           "* %U {%^{estimate of time spent}} %^{log}%?" :prepend t))

     (add-to-list 'org-capture-templates '("n" "Note" entry
                                           (id "6D1B101A-FBCD-44AB-9414-B5686DB42D26")
                                           "* %^{title} %U%?"))

     (add-to-list 'org-capture-templates '("s" "Snippet" entry
                                          (id "AA63C881-1070-4DBB-BBE5-917FCDD2A309")
                                          "* %^{title}: %?"))

     ;; http://irreal.org/blog/?p=5325
     (add-to-list 'org-capture-templates '("j" "Journal" entry
                                          (file+datetree "~/Sync/Notes/JOURNAL.org")
                                          "* %t %?"
                                          :jump-to-captured t
                                          :immediate-finish t))

     (add-to-list 'org-capture-templates '("t" "Task" entry
                                          (id "2CF309C5-3F4E-4C98-AE0D-ACFAAF79C016")
                                          "* TODO %?"))
   #+END_SRC

   #+RESULTS:
   | m | Manual Cookbook | entry | (file ~/Sync/Notes/Cookbook.org) | * %^{Recipe title: } |

* Magit
  #+BEGIN_SRC emacs-lisp
    (setq magit-repository-directories '(("~/Projects" . 1) ("~/.emacs.d" . 1)))
  #+END_SRC
